app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Test"], ["room_number", 12]]
---
    def create
        @klass = SchoolClass.new(klass_params)
        @klass.save